/*
========================================================================================
                               // ****हर हर महादेव🙏🙏***** //
                              // ***AUTHOR: GAURISH OJHA** //
                             // *****DATE: 16-02-2022**** //
                            // ******TIME:20:04:11****** //
========================================================================================
*/
#include<bits/stdc++.h>
#define ll long long int
using namespace std;

int main()
{
    ios_base::sync_with_stdio(0);
    cin.tie(0);
    ll t=1;
    cin>>t;
     
    while(t--) 
    {

       ll a,b,c;
       cin>>a>>b>>c;
       cout
    //   if(25*c<=b)
    //   {  if(a%4==0)
    //       cout<<(a/4)*c<<"\n";
    //       else
    //       cout<<((a/4)+1)*c<<"\n";
    //   }
    //   else
    //   {
    //       if(b<=c)
    //       {
    //       if(a%100==0)
    //       cout<<(a/100)*b<<"\n";
    //       else
    //       cout<<((a/100)+1)*b<<"\n";
    //       }
    //       else
    //       {
    //           if(a>=100)
    //           {

    //           }
    //       }
    //   }  

     }
}
