//===================================================================================//
                               //      हर हर महादेव🙏🙏   //
                              //    AUTHOR: GAURISH OJHA //
                             //     DATE: 12-02-2022    //
                            //      TIME:19:46:02      //
//===================================================================================//

#include<bits/stdc++.h>
#define ll long long int
using namespace std;

int main()
{
    ios_base::sync_with_stdio(0);
    cin.tie(0);
    ll t=1;
    cin>>t;
     
    while(t--) 
    {
        
    }
}
